---
kind: method
id: M:Autodesk.Revit.DB.ElementRecord.Dispose
source: html/757f7509-aa38-9ea4-2485-03051bea3701.htm
---
# Autodesk.Revit.DB.ElementRecord.Dispose Method

Releases all resources used by the ElementRecord

## Syntax (C#)
```csharp
public void Dispose()
```